{
    "config": {
        "ncells": null,
        "centroid_score_threshold": null,
        "ndocs": null,
        "index_path": null,
        "nbits": 8,
        "kmeans_niters": 20,
        "resume": false,
        "similarity": "cosine",
        "bsize": 64,
        "accumsteps": 1,
        "lr": 3e-6,
        "maxsteps": 500000,
        "save_every": null,
        "warmup": null,
        "warmup_bert": null,
        "relu": false,
        "nway": 2,
        "use_ib_negatives": false,
        "reranker": false,
        "distillation_alpha": 1.0,
        "ignore_scores": false,
        "query_maxlen": 32,
        "attend_to_mask_tokens": false,
        "interaction": "colbert",
        "dim": 128,
        "doc_maxlen": 512,
        "mask_punctuation": true,
        "checkpoint": "BByrneLab\/PreFLMR_ViT-G",
        "triples": null,
        "queries": null,
        "index_name": "EVQA_PreFLMR_ViT-G.nbits=8",
        "overwrite": false,
        "root": ".",
        "experiment": "EVQA",
        "index_root": null,
        "name": "2024-02\/02\/22.26.33",
        "rank": 0,
        "nranks": 1,
        "amp": true,
        "total_visible_gpus": 1,
        "gpus": 1,
        "collection": [
            "Heracleum mantegazzianum, commonly known as giant hogweed, is a monocarpic perennial herbaceous plant in the carrot family Apiaceae. H. mantegazzianum is also known as cartwheel-flower, giant cow parsley, giant cow parsnip, or hogsbane. In New Zealand, it is also sometimes called wild parsnip (not to be confused with Pastinaca sativa) or wild rhubarb.\nGiant hogweed is native to the western Caucasus region of Eurasia. It was introduced to Britain as an ornamental plant in the 19th century, and has also spread to other areas in Western Europe, the United States, and Canada. Its close relatives, Sosnowsky's hogweed and Persian hogweed, have similarly spread to other parts of Europe.\nThe sap of giant hogweed is phototoxic and causes phytophotodermatitis in humans, resulting in blisters and scars.  These serious reactions are due to the furanocoumarin derivatives in the leaves, roots, stems, flowers, and seeds of the plant. Consequently, it is considered to be a noxious weed in many jurisdictions.",
            "The life cycle of giant hogweed consists of four phases:\nPre-flowering plants: In the first year, leaves sprout from seed. In subsequent years, leaves sprout from overwintering roots as well as seeds. This pre-flowering phase continues for several years.\nFlowering plants (midsummer): After several years of growth, the plant flowers.\nSeeds (late summer\/early autumn): A flowering plant produces 20,000 or more seeds.\nDead stems (late autumn\/winter): After producing seeds, the plant dies, leaving dried stems and seed heads standing.\nDuring the first few years of growth, the leaves and stem of a pre-flowering plant die over the winter. In the spring, the plant grows back from its root. In other words, the giant hogweed is a herbaceous perennial.\nA giant hogweed plant usually produces a flowering stalk in 3–5 years, but plants may take up to eight years to flower if conditions are unfavorable. In the Czech Republic, a single plant reached twelve years old before flowering. In any case, when the plant finally flowers, it does so between June and July (in the northern hemisphere).\nSeeds are typically produced in August. A single flowering plant will produce 20,000 seeds on average with seed production varying between 10,000 and 50,000 seeds per plant.\nGiant hogweed is a monocarpic perennial, that is, after a mature plant flowers and produces seed, the entire plant dies. During the following winter, tall dead stems mark the locations where the flowering plants once stood.\nThe seeds are dispersed short distances by wind, but can travel longer distances by water, animals, and people. Most seeds (95%) are found in the top 5 cm (2 in) of the soil within a few meters of the parent plant. Seeds may stay alive in the seed bank for more than five years.\nA seed deposited in the seed bank is initially dormant. Dormancy is broken by the cold and wet conditions of fall and winter, and so freshly deposited seeds lie dormant until at least the following spring, at which time approximately 90% of the previously dormant seeds will germinate. The rest remain dormant in the seed bank.\nSeeds normally result from cross-pollination between two or more plants but self-pollination is also possible. More than half the seeds produced by self-pollination will germinate and give rise to healthy seedlings. Hence a single isolated seed may give rise to a colony of new plants.",
            "Because of its phototoxicity and invasive nature, giant hogweed is often actively removed. The European Union funded the Giant Alien project to combat the plant.\nOn August 2, 2017, it added the species to its List of Invasive Alien Species of Union concern,\nthus placing restrictions on keeping, importing, selling, breeding and growing it and requiring governments to detect and eradicate it throughout the EU. In the United Kingdom, the Wildlife and Countryside Act 1981 makes it an offence to plant or cause giant hogweed to grow in the wild.\nIn the United States, hogweed is regulated as a federal noxious weed by the U.S. Government, and is illegal to import into the United States or move interstate without a permit from the Department of Agriculture.  The USDA Forest Service states pigs and cattle can eat it without apparent harm. The New York State Department of Environmental Conservation has had an active program to control giant hogweed since 2008. In 2011, Maine state horticulturists, describing the plant as \"Queen Anne's lace on steroids\", reported that it has been found at 21 different locations in Maine, with the number of plants ranging from one to a hundred."
        ]
    },
    "num_chunks": 3,
    "num_partitions": 32768,
    "num_embeddings_est": 9739483.208007812,
    "avg_doclen_est": 189.21905517578125
}
